"""### **Άσκηση 1**:

Χρησιμοποιώντας τις ιδιότητες/λειτουργίες των λιστών, υπολογίστε το μέσο όρο των βαθμών σε 3 μαθήματα, με 2 τρόπους, που περιγράφονται στα hints.

Στη συνέχεια προσθέστε το βαθμό ενός ακόμα μαθήματος και ξαναϋπολογίστε το μέσο όρο και στρογγυλοποιήστε τον ώστε να μην έχει κανένα δεκαδικό ψηφίο.

Τέλος, βρείτε το μεγαλύτερο βαθμό, τον μικρότερο βαθμό και το πλήθος των βαθμών.

*Hints*:
- φτιάξτε μια μεταβλητή για το βαθμό κάθε μαθήματος
- φτιάξτε μια λίστα που θα περιέχει τις παραπάνω μεταβλητές
- χρησιμοποιήστε τη συνάρτηση ```mean``` της βιβλιοθήκης ```statistics``` για να υπολογίσετε το μέσο όρο (from statistics import mean) - 1ος τρόπος
- χρησιμοποιήστε τις συναρτήσεις ```sum()``` και ```len()``` για λίστες, για να εφαρμόσετε τον τύπο υπολογισμού του μέσου όρου: ```<άθροισμα βαθμών> / <πλήθος βαθμών>``` - 2ος τρόπος
- χρησιμοποιήστε τη συνάρτηση ```round()``` για να στογγυλοποιήσετε το μέσο όρο
- χρησιμοποιήστε τις συναρτήσεις ```max()```, ```min()``` και ```len()``` για να βρείτε αντίστοιχα το μεγαλύτερο βαθμό, τον μικρότερο βαθμό και το πλήθος των βαθμών

*Tips*:
- γράψτε μία-μία τις εντολές σε διαφορετικά κελιά και τυπώνετε το αποτέλεσμα της κάθε εντολής για να ελέγχετε το τι κάνετε
- συμβουλευτείτε / αποδεχθείτε τις προτάσεις που σας κάνει το Gemini καθώς πληκτρολογείτε τις εντολές, πατώντας Tab - κάνετε διορθώσεις όπου χρειάζεται.
"""
#Χρησιμοποιώντας τις ιδιότητες/λειτουργίες των λιστών, υπολογίστε το μέσο όρο των βαθμών σε 3 μαθήματα, με 2 τρόπους, που περιγράφονται στα hints.
grade_course1 = 4
grade_course2 = 5
grade_course3 = 6
grades = [grade_course1, grade_course2, grade_course3]

# 1ος τρόπος
avg = sum(grades) / len(grades)
print(f"Ο μέσος όρος των βαθμών είναι: {avg}")

# 2ος τρόπος
for grade in grades:
    avg2 = sum(grades) / len(grades)
print(f"Ο μέσος όρος των βαθμών είναι: {avg2}")

#Στη συνέχεια προσθέστε το βαθμό ενός ακόμα μαθήματος και ξαναϋπολογίστε το μέσο όρο και στρογγυλοποιήστε τον ώστε να μην έχει κανένα δεκαδικό ψηφίο.
grade_course4 = 10
grades.append(grade_course4)
avg3 = sum(grades) / len(grades)
avg3_rounded = round(avg3)
print(f"Ο νέος μέσος όρος των βαθμών είναι: {avg3_rounded}")

#Τέλος, βρείτε το μεγαλύτερο βαθμό, τον μικρότερο βαθμό και το πλήθος των βαθμών.
max_grade = max(grades)
min_grade = min(grades)
count_grades = len(grades)
print(f"Ο μεγαλύτερος βαθμός είναι: {max_grade}")
print(f"Ο μικρότερος βαθμός είναι: {min_grade}")
print(f"Το πλήθος των βαθμών είναι: {count_grades}")