"""Δημιουργήστε τις παρακάτω μεταβλητές:
- όνομα
- επώνυμο
- αριθμός μητρώου
- μάθημα 1
- μάθημα 2
- μάθημα 3
- βαθμός μαθήματος 1
- βαθμός μαθήματος 2
- βαθμός μαθήματος 3""" 
name = "Orestis"
surname = "Savvas"
student_id = 123456
course1 = "Mathematics"
course2 = "Physics"
course3 = "Chemistry"
grade_course1 = 4
grade_course2 = 5
grade_course3 = 6

"""Υπολογίστε το μέσο όρο των βαθμών των 3 μαθημάτων, αποθηκεύστε τον σε μια μεταβλητή και τυπώστε την τιμή της μεταβλητής του μέσου όρου στην οθόνη.

**Hints**:
- ο μέσος όρος υπολογίζεται με τη φόρμουλα: <άθροισμα επιμέρους τιμών> δια <πλήθος τιμών>
- για τον υπολογισμό του μέσου όρου χρησιμοποιήστε τα ονόματα των μεταβλητών των επιμέρους τιμών και όχι τις τιμές τους"""

average_grade = (grade_course1 + grade_course2 + grade_course3) / 3
#Τυπώστε στην οθόνη την τιμή του μέσου όρου και τον τύπο δεδομένων της μεταβλητής του μέσου όρου.
print(f"Ο μέσος όρος των βαθμών είναι: {average_grade}, και ο τύπος δεδομένων της μεταβλητής του μέσου όρου είναι: {type(average_grade)}")

#Μετατρέψτε το μέσο όρο σε ακέραιο (integer) και τυπώστε το αποτέλεσμα στην οθόνη.
average_grade_int = int(average_grade)
print(f"Ο μέσος όρος των βαθμών ως ακέραιος είναι: {average_grade_int}")

"""Αλλάξτε τις τιμές των μεταβλητών των βαθμών των μαθημάτων και ξαναϋπολογίστε τον μέσο όρο."""
grade_course1 = 10
grade_course2 = 10
grade_course3 = 10
average_grade = (grade_course1 + grade_course2 + grade_course3) / 3
print(f"Ο νέος μέσος όρος των βαθμών είναι: {average_grade}")