#1) Ας υποθέσουμε ότι είμαστε πολύ κακοί γιατροί και έχουμε έναν ασθενή.
#Ορίστε ένα λεξικό που να λέγεται patient και θα δουλεύει με τον παρακάτω κώδικα.

patient = {
'name': 'Orestis Savvas',
'complaint':'πυρετό', 
}
print(f"Γιατρέ, ο ασθενής {patient["name"]} παραπονιέται ότι έχει", patient['complaint'])

#2) Δεν δίνουμε πολύ σημασία στον ασθενή, αλλά όσο έρχονται νέα αποτελέσματα εξετάσεων, τα προσθέτουμε στο λεξικό του ασθενή:
patient.update({'Heart rate': 70, 'Temperature': 98.6, 'Infection': 'No'}) 
#Τυπώστε τα keys του λεξικού
print(patient.keys())
print(patient)

##3) Τώρα ας γίνουμε γιατροί! Πρώτα πρέπει αν έχουν heart rate ίσο ή μεγαλύτερο από το 100, πρέπει να τους πούμε να ηρεμήσουν.
if patient['Heart rate'] >= 100:
    print("Παρακαλώ ηρεμήστε, ο καρδιακός σας ρυθμός είναι υψηλός.")
    #Αποθηκεύστε τη διάγνωση σας σε ένα κλειδί (key) που θα λέγεται 'diagnosis'.
    patient['diagnosis'] = 'High heart rate'
else:
    print("Ο καρδιακός σας ρυθμός είναι φυσιολογικός.")